

with source as (

SELECT

	[Идентификатор подключенного аккаунта]
	, [Идентификатор клиента]
	, [Идентификатор источника трафика]
	, [Идентификатор пользователя]
	, [Идентификатор лида]
	, [Идентификатор контакта]
	, [Идентификатор компании]
	, [Идентификатор местоположения]
	, [Идентификатор сделки]
	, [Идентификатор даты создания]
	, [Идентификатор даты закрытия]
	, Сумма

FROM {{ source('bitrix24', 'leads_facts') }}

{{ filter_rows(
    account_id=var('account_id_b24'),
    last_number_of_days=false, 
    ts_field=none
) }}

)

select * from source