{{
    config({
        "materialized": 'view'
    })
}}

{% set account_id = var('account_id_b24') %}

with source as (

SELECT

	[Идентификатор подключенного аккаунта]
	, [Идентификатор клиента]
	, [Идентификатор источника трафика]
	, [Идентификатор пользователя]
	, [Идентификатор лида]
	, [Идентификатор контакта]
	, [Идентификатор компании]
	, [Идентификатор местоположения]
	, [Идентификатор сделки]
	, [Идентификатор даты создания]
	, [Идентификатор даты закрытия]
	, Сумма

FROM {{ source('bitrix24', 'leads_facts') }}

WHERE 1=1
	AND [Идентификатор подключенного аккаунта] in ({{ account_id }})

)

select * from source