{{
    config({
        "materialized": 'view'
    })
}}

with source as (

SELECT

	[Идентификатор подключенного аккаунта]
	, [Идентификатор клиента]
	, [Идентификатор источника трафика]
	, [Идентификатор пользователя]
	, [Идентификатор сделки]
	, [Идентификатор контакта]
	, [Идентификатор компании]
	, [Идентификатор местоположения]
	, [Дата открытия сделки]
	, [Дата закрытия сделки]
	, [Идентификатор товара]
	, Количество
	, Сумма
	, [Сумма скидки]

FROM {{ source('bitrix24', 'products_facts') }}

{{ filter_rows(
    account_id=var('account_id_b24'),
    last_number_of_days=false, 
    ts_field=none
) }}

)

select * from source