{{
    config({
        "materialized": 'view'
    })
}}

with source as (

SELECT

	  [Идентификатор подключенного аккаунта]
	, [Идентификатор клиента]
	, [Идентификатор источника трафика]
	, [Идентификатор пользователя]
	, [Идентификатор сделки]
	, [Идентификатор контакта]
	, [Идентификатор компании]
	, [Идентификатор местоположения]
	, [Дата создания сделки]
	, [Дата открытия сделки]
	, [Дата закрытия сделки]
	, Сумма

FROM {{ source('bitrix24', 'deals_facts') }}

{{ filter_rows(
    account_id=var('account_id_b24'),
    last_number_of_days=false, 
    ts_field=none
) }}

)

select * from source