{{
    config({
        "materialized": 'view'
    })
}}

{% set account_id = var('account_id_amocrm') %}

with source as (

SELECT

	[Идентификатор подключенного аккаунта],
	[Идентификатор клиента],
	[Идентификатор пользователя],
	[Идентификатор сделки],
	[Идентификатор контакта],
	[Идентификатор компании],
	[Идентификатор даты открытия сделки],
	[Идентификатор даты закрытия сделки],
	Сумма

FROM {{ source('amocrm', 'leads_facts') }}

WHERE 1=1
	AND [Идентификатор подключенного аккаунта] in ( {{ account_id }} )

)

select * from source