{{
    config({
        "materialized": 'view',
		"enabled": False
    })
}}

{% set account_id = var('account_id_direct') %}

with source as (

SELECT

	  [Идентификатор записи]
	, [Идентификатор подключенного аккаунта]
	, [Идентификатор отчета]
	, [Дата отчета]

	, Дата
	, CAST([Идентификатор кампании] AS BIGINT) as [Идентификатор кампании]
	, [Название кампании]
	, CAST([Идентификатор группы объявлений] AS BIGINT) as [Идентификатор группы объявлений]
	, [Название группы объявлений]
	, CAST([Идентификатор объявления] AS BIGINT) as [Идентификатор объявления]
	, CAST([Идентификатор условия показа рекламодателя] AS BIGINT) as [Идентификатор условия показа рекламодателя]
	, [Условие показа рекламодателя]
	, [Тип условия показа рекламодателя]
	, [Тип соответствия ключевой фразе]
	, [Поисковый запрос]

	, [Количество показов]
	, [Количество кликов]
	, CAST([Стоимость кликов] AS FLOAT) as [Стоимость кликов]
	, CAST(Доход AS FLOAT) as Доход
	, [Количество отказов]
	, case
		when [Доля отказов] = '--' then null
		else CAST([Доля отказов] AS FLOAT)
	  end as [Доля отказов]

FROM {{ source('direct', 'keywords_facts') }}

WHERE 1=1
	AND [Идентификатор подключенного аккаунта] = {{ account_id }}

)

select * from source